[
    {
        "title": "A Origem",
        "releaseDate": { "$date": "2010-07-16T00:00:00.000-0700" },
        "duration": 148,
        "thumbnailUrl": "https://example.com/inception.jpg",
        "shortDescription": "Inception é um thriller de ficção científica sobre um ladrão que entra nos sonhos de outras pessoas para roubar segredos.",
        "longDescription": "Inception é um filme de ficção científica de 2010 dirigido por Christopher Nolan. O filme é estrelado por Leonardo DiCaprio como Dom Cobb, um ladrão profissional que rouba informações infiltrando-se no subconsciente de seus alvos. Cobb é oferecido a chance de ter seu histórico criminal apagado como pagamento pela implantação da ideia de outra pessoa no subconsciente de um alvo. O elenco inclui Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Ellen Page, Tom Hardy, Cillian Murphy, Dileep Rao, Tom Berenger e Michael Caine. Inception explora temas de realidade, sonhos e a mente subconsciente, e é conhecido por sua complexa estrutura narrativa e efeitos visuais.",
        "status": "RELEASED",
        "directors": ["Christopher Nolan"],
        "cast": ["Leonardo DiCaprio", "Joseph Gordon-Levitt", "Ellen Page", "Tom Hardy", "Marion Cotillard"],
        "categories": ["Ficção", "Terror"]
    },
    {
        "title": "Matrix",
        "releaseDate": { "$date": "1999-03-31T00:00:00.000-0700" },
        "duration": 136,
        "thumbnailUrl": "https://example.com/thematrix.jpg",
        "shortDescription": "Matrix é um filme de ação e ficção científica que explora a natureza da realidade e a consciência humana.",
        "longDescription": "Matrix é um filme de ação e ficção científica de 1999 escrito e dirigido pelos Wachowskis. É estrelado por Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss e Hugo Weaving. A história retrata um futuro distópico onde a humanidade está inconscientemente presa dentro de uma realidade simulada, a Matrix, criada por máquinas inteligentes para distrair os humanos enquanto usam seus corpos como fonte de energia. O programador de computador Neo descobre essa verdade e se junta a uma rebelião contra as máquinas junto com outras pessoas que foram libertadas da Matrix.",
        "status": "RELEASED",
        "directors": ["Lana Wachowski", "Lilly Wachowski"],
        "cast": ["Keanu Reeves", "Laurence Fishburne", "Carrie-Anne Moss", "Hugo Weaving"],
        "categories": ["Ficção", "Ação"]
    },
    {
        "title": "O Poderoso Chefão",
        "releaseDate": { "$date": "1972-03-24T00:00:00.000-0700" },
        "duration": 175,
        "thumbnailUrl": "https://example.com/thegodfather.jpg",
        "shortDescription": "O Poderoso Chefão é um clássico drama policial sobre a poderosa família criminosa ítalo-americana Corleone.",
        "longDescription": "O Poderoso Chefão é um filme policial americano de 1972 dirigido por Francis Ford Coppola e produzido por Albert S. Ruddy, baseado no romance best-seller de Mario Puzo com o mesmo nome. É estrelado por Marlon Brando, Al Pacino, James Caan, Richard S. Castellano, Robert Duvall, Sterling Hayden, John Marley, Richard Conte e Diane Keaton. A história abrange os anos de 1945 a 1955 e narra a família Corleone sob o patriarca Vito Corleone, focando na transformação de seu filho mais novo, Michael Corleone, de um relutante outsider da família para um implacável chefe da máfia.",
        "status": "RELEASED",
        "directors": ["Francis Ford Coppola"],
        "cast": ["Marlon Brando", "Al Pacino", "James Caan", "Robert Duvall", "Diane Keaton"],
        "categories": ["Crime", "Drama"]
    },
    {
        "title": "Pulp Fiction: Tempo de Violência",
        "releaseDate": { "$date": "1994-10-14T00:00:00.000-0700" },
        "duration": 154,
        "thumbnailUrl": "https://example.com/pulpfiction.jpg",
        "shortDescription": "Pulp Fiction é um filme de comédia criminal neo-noir com histórias interligadas de crime e redenção.",
        "longDescription": "Pulp Fiction é um filme de comédia criminal neo-noir americano de 1994 escrito e dirigido por Quentin Tarantino, que o concebeu com Roger Avary. Estrelando John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames e Uma Thurman, conta várias histórias de crime em Los Angeles. O título do filme refere-se às revistas pulp e romances policiais populares na metade do século 20, conhecidos por sua violência gráfica e diálogos contundentes. O roteiro é conhecido por seu diálogo eclético, mistura irônica de humor e violência, narrativa não linear e uma série de alusões cinematográficas e referências à cultura pop.",
        "status": "RELEASED",
        "directors": ["Quentin Tarantino"],
        "cast": ["John Travolta", "Samuel L. Jackson", "Uma Thurman", "Bruce Willis"],
        "categories": ["Crime", "Drama"]
    },
    {
        "title": "Um Sonho de Liberdade",
        "releaseDate": { "$date": "1994-09-23T00:00:00.000-0700" },
        "duration": 142,
        "thumbnailUrl": "https://example.com/shawshank.jpg",
        "shortDescription": "Um Sonho de Liberdade é um drama sobre um homem injustamente preso por assassinato e sua busca pela liberdade.",
        "longDescription": "Um Sonho de Liberdade é um filme de drama americano de 1994 escrito e dirigido por Frank Darabont, baseado na novela de Stephen King de 1982, 'Rita Hayworth e a Redenção de Shawshank'. Estrelado por Tim Robbins como Andrew 'Andy' Dufresne e Morgan Freeman como Ellis 'Red' Redding. O filme conta a história de Andy Dufresne, um banqueiro que é condenado à prisão perpétua na Penitenciária Estadual de Shawshank pelo assassinato de sua esposa e seu amante, apesar de suas alegações de inocência. Nas duas décadas seguintes, ele faz amizade com um colega prisioneiro, contrabandista Red, e torna-se instrumental em uma operação de lavagem de dinheiro liderada pelo diretor da prisão.",
        "status": "RELEASED",
        "directors": ["Frank Darabont"],
        "cast": ["Tim Robbins", "Morgan Freeman", "Bob Gunton", "William Sadler"],
        "categories": ["Drama"]
    },
    {
        "title": "Batman: O Cavaleiro das Trevas",
        "releaseDate": { "$date": "2008-07-18T00:00:00.000-0700" },
        "duration": 152,
        "thumbnailUrl": "https://example.com/thedarkknight.jpg",
        "shortDescription": "Batman: O Cavaleiro das Trevas é um filme de super-herói que coloca Batman contra o criminoso conhecido como Coringa.",
        "longDescription": "Batman: O Cavaleiro das Trevas é um filme de super-herói de 2008 dirigido, produzido e co-escrito por Christopher Nolan. Baseado no personagem da DC Comics, Batman, o filme é o segundo da trilogia The Dark Knight de Nolan e a sequência de 'Batman Begins' de 2005. Christian Bale reprisa o papel principal de Bruce Wayne/Batman, com um elenco retornando composto por Michael Caine como Alfred Pennyworth, Gary Oldman como James Gordon e Morgan Freeman como Lucius Fox. O filme introduz o personagem Harvey Dent (Aaron Eckhart), o recém-eleito promotor público de Gotham e o aliado da amiga de infância de Bruce Wayne, Rachel Dawes (Maggie Gyllenhaal). A trama trata da contínua guerra de Bruce Wayne/Batman contra o crime, com a ajuda do tenente Jim Gordon e do promotor Harvey Dent, e como eles devem desmantelar as organizações criminosas restantes que atormentam as ruas. Logo se encontram sob o ataque de um criminoso emergente conhecido como Coringa, interpretado por Heath Ledger.",
        "status": "RELEASED",
        "directors": ["Christopher Nolan"],
        "cast": ["Christian Bale", "Heath Ledger", "Aaron Eckhart", "Michael Caine"],
        "categories": ["Ação", "Crime"]
    },
    {
        "title": "Forrest Gump - O Contador de Histórias",
        "releaseDate": { "$date": "1994-07-06T00:00:00.000-0700" },
        "duration": 142,
        "thumbnailUrl": "https://example.com/forrestgump.jpg",
        "shortDescription": "Forrest Gump é um filme de drama sobre um homem de bom coração e ingênuo que testemunha e influencia inadvertidamente vários eventos históricos.",
        "longDescription": "Forrest Gump é um filme de drama americano de 1994 dirigido por Robert Zemeckis e escrito por Eric Roth. É baseado no romance de 1986 de mesmo nome de Winston Groom e estrelado por Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson e Sally Field. A história retrata várias décadas na vida de Forrest Gump, um homem de bom coração e ingênuo do Alabama que testemunha e influencia inadvertidamente vários eventos históricos nos Estados Unidos do século XX.",
        "status": "RELEASED",
        "directors": ["Robert Zemeckis"],
        "cast": ["Tom Hanks", "Robin Wright", "Gary Sinise", "Sally Field"],
        "categories": ["Drama", "Romance"]
    },
    {
        "title": "O Senhor dos Anéis: A Sociedade do Anel",
        "releaseDate": { "$date": "2001-12-19T00:00:00.000-0700" },
        "duration": 178,
        "thumbnailUrl": "https://example.com/lotr_fellowship.jpg",
        "shortDescription": "Um filme de fantasia épica sobre a jornada de um jovem hobbit para destruir um anel poderoso.",
        "longDescription": "O Senhor dos Anéis: A Sociedade do Anel é um filme de aventura de fantasia épica de 2001 dirigido por Peter Jackson, baseado no primeiro volume de O Senhor dos Anéis de J.R.R. Tolkien. É a primeira parte da trilogia O Senhor dos Anéis e estrela Elijah Wood como Frodo Baggins, Ian McKellen como Gandalf e Viggo Mortensen como Aragorn. A história segue Frodo Baggins em uma jornada perigosa para destruir o Um Anel e garantir a destruição de seu criador, o Senhor das Trevas Sauron.",
        "status": "RELEASED",
        "directors": ["Peter Jackson"],
        "cast": ["Elijah Wood", "Ian McKellen", "Viggo Mortensen", "Orlando Bloom"],
        "categories": ["Fantasia", "Aventura"]
    },
    {
        "title": "Star Wars: Episódio IV - Uma Nova Esperança",
        "releaseDate": { "$date": "1977-05-25T00:00:00.000-0700" },
        "duration": 121,
        "thumbnailUrl": "https://example.com/starwars_newhope.jpg",
        "shortDescription": "Um jovem fazendeiro se torna um herói em uma batalha contra um império maligno.",
        "longDescription": "Star Wars: Episódio IV - Uma Nova Esperança é um filme épico de space opera de 1977 escrito e dirigido por George Lucas. É o primeiro filme lançado na saga Star Wars e estrela Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing e Alec Guinness. A história segue Luke Skywalker enquanto ele se envolve na luta da Aliança Rebelde contra o tirânico Império Galáctico e aprende os caminhos da Força com o Mestre Jedi Obi-Wan Kenobi.",
        "status": "RELEASED",
        "directors": ["George Lucas"],
        "cast": ["Mark Hamill", "Harrison Ford", "Carrie Fisher", "Alec Guinness"],
        "categories": ["Ficção", "Aventura"]
    },
    {
        "title": "Jurassic Park: O Parque dos Dinossauros",
        "releaseDate": { "$date": "1993-06-11T00:00:00.000-0700" },
        "duration": 127,
        "thumbnailUrl": "https://example.com/jurassicpark.jpg",
        "shortDescription": "Um filme de aventura de ficção científica sobre um parque temático com dinossauros clonados.",
        "longDescription": "Jurassic Park: O Parque dos Dinossauros é um filme de aventura de ficção científica americano de 1993 dirigido por Steven Spielberg e baseado no romance de 1990 de mesmo nome de Michael Crichton. O filme é estrelado por Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough, Bob Peck, Martin Ferrero, BD Wong, Samuel L. Jackson, Wayne Knight, Joseph Mazzello e Ariana Richards. A história envolve a tentativa desastrosa de criar um parque temático de dinossauros clonados.",
        "status": "RELEASED",
        "directors": ["Steven Spielberg"],
        "cast": ["Sam Neill", "Laura Dern", "Jeff Goldblum", "Richard Attenborough"],
        "categories": ["Ficção", "Aventura"]
    },
    {
        "title": "Titanic",
        "releaseDate": { "$date": "1997-12-19T00:00:00.000-0700" },
        "duration": 195,
        "thumbnailUrl": "https://example.com/titanic.jpg",
        "shortDescription": "Um drama romântico ambientado contra a viagem inaugural malograda do R.M.S. Titanic.",
        "longDescription": "Titanic é um filme épico de romance e desastre americano de 1997 dirigido, escrito, produzido e co-editado por James Cameron. Incorporando aspectos históricos e fictícios, o filme é baseado em relatos do naufrágio do RMS Titanic e estrela Leonardo DiCaprio e Kate Winslet como membros de diferentes classes sociais que se apaixonam a bordo do navio durante sua viagem inaugural malograda.",
        "status": "RELEASED",
        "directors": ["James Cameron"],
        "cast": ["Leonardo DiCaprio", "Kate Winslet", "Billy Zane", "Kathy Bates"],
        "categories": ["Romance", "Drama"]
    },
    {
        "title": "O Rei Leão",
        "releaseDate": { "$date": "1994-06-15T00:00:00.000-0700" },
        "duration": 88,
        "thumbnailUrl": "https://example.com/lionking.jpg",
        "shortDescription": "Um drama musical animado sobre um jovem leão que deve recuperar seu reino.",
        "longDescription": "O Rei Leão é um filme de drama musical animado americano de 1994 produzido pela Walt Disney Feature Animation e lançado pela Walt Disney Pictures. É o 32º filme de animação da Disney e foi dirigido por Roger Allers e Rob Minkoff. O filme conta a história de Simba, um jovem leão que deve suceder seu pai, Mufasa, como Rei da Terra do Leão; no entanto, depois que o tio de Simba, Scar, mata Mufasa, Simba é manipulado a pensar que foi responsável e foge para o exílio.",
        "status": "RELEASED",
        "directors": ["Roger Allers", "Rob Minkoff"],
        "cast": ["Matthew Broderick", "James Earl Jones", "Jeremy Irons", "Moira Kelly"],
        "categories": ["Animação", "Musical"]
    },
    {
        "title": "De Volta para o Futuro",
        "releaseDate": { "$date": "1985-07-03T00:00:00.000-0700" },
        "duration": 116,
        "thumbnailUrl": "https://example.com/backtothefuture.jpg",
        "shortDescription": "Uma aventura de ficção científica sobre um adolescente que viaja no tempo.",
        "longDescription": "De Volta para o Futuro é um filme de ficção científica americano de 1985 dirigido por Robert Zemeckis e escrito por Zemeckis e Bob Gale. Estrela Michael J. Fox como o adolescente Marty McFly, que viaja acidentalmente no tempo para 1955, onde conhece seus pais no futuro e se torna o interesse romântico de sua mãe. Christopher Lloyd interpreta o excêntrico cientista Dr. Emmett 'Doc' Brown, seu amigo que o ajuda a reparar a história e retornar a 1985.",
        "status": "RELEASED",
        "directors": ["Robert Zemeckis"],
        "cast": ["Michael J. Fox", "Christopher Lloyd", "Lea Thompson", "Crispin Glover"],
        "categories": ["Ficção", "Aventura"]
    },
    {
        "title": "Gladiador",
        "releaseDate": { "$date": "2000-05-05T00:00:00.000-0700" },
        "duration": 155,
        "thumbnailUrl": "https://example.com/gladiator.jpg",
        "shortDescription": "Um drama histórico épico sobre um general romano traído que busca vingança.",
        "longDescription": "Gladiador é um filme épico de drama histórico de 2000 dirigido por Ridley Scott e escrito por David Franzoni, John Logan e William Nicholson. O filme estrela Russell Crowe como um general romano que é traído e vendido como escravo, mas se eleva através das fileiras da arena de gladiadores para vingar os assassinatos de sua família e de seu imperador. O filme também conta com Joaquin Phoenix, Connie Nielsen, Ralf Möller, Oliver Reed, Djimon Hounsou, Derek Jacobi, John Shrapnel e Richard Harris.",
        "status": "RELEASED",
        "directors": ["Ridley Scott"],
        "cast": ["Russell Crowe", "Joaquin Phoenix", "Connie Nielsen", "Oliver Reed"],
        "categories": ["Ação", "Drama"]
    },
    {
        "title": "Avatar",
        "releaseDate": { "$date": "2009-12-18T00:00:00.000-0700" },
        "duration": 162,
        "thumbnailUrl": "https://example.com/avatar.jpg",
        "shortDescription": "Um filme de ficção científica sobre humanos explorando um planeta distante e os conflitos que surgem.",
        "longDescription": "Avatar é um filme de ficção científica épico americano de 2009 dirigido, escrito, produzido e co-editado por James Cameron. O filme se passa no século XXII médio, quando os humanos estão colonizando Pandora, uma lua habitável e exuberante de um gigante gasoso no sistema estelar Alpha Centauri, para minerar o valioso mineral unobtanium. A expansão da colônia de mineração ameaça a existência contínua de uma tribo local de Na'vi—uma espécie humanoides indígenas de Pandora. O título do filme se refere a um corpo Na'vi geneticamente modificado operado a partir do cérebro de um humano localizado remotamente, que é usado para interagir com os nativos de Pandora.",
        "status": "RELEASED",
        "directors": ["James Cameron"],
        "cast": ["Sam Worthington", "Zoe Saldana", "Sigourney Weaver", "Stephen Lang"],
        "categories": ["Ficção", "Aventura"]
    },
    {
        "title": "Os Vingadores",
        "releaseDate": { "$date": "2012-05-04T00:00:00.000-0700" },
        "duration": 143,
        "thumbnailUrl": "https://example.com/theavengers.jpg",
        "shortDescription": "Um filme de super-herói sobre uma equipe de heróis que deve salvar o mundo de uma invasão alienígena.",
        "longDescription": "Os Vingadores é um filme americano de super-heróis de 2012 baseado na equipe de super-heróis da Marvel Comics com o mesmo nome. Produzido pela Marvel Studios e distribuído pela Walt Disney Studios Motion Pictures, é o sexto filme no Universo Cinematográfico Marvel (MCU). O filme foi escrito e dirigido por Joss Whedon e apresenta um elenco de conjunto incluindo Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson e Jeremy Renner como os Vingadores titulares, ao lado de Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård e Samuel L. Jackson. No filme, Nick Fury e a agência de espionagem S.H.I.E.L.D. recrutam Tony Stark, Steve Rogers, Bruce Banner e Thor para formar uma equipe capaz de impedir que o irmão de Thor, Loki, subjulgue a Terra.",
        "status": "RELEASED",
        "directors": ["Joss Whedon"],
        "cast": ["Robert Downey Jr.", "Chris Evans", "Mark Ruffalo", "Chris Hemsworth"],
        "categories": ["Ação", "Super-herói"]
    },
    {
        "title": "Clube da Luta",
        "releaseDate": { "$date": "1999-10-15T00:00:00.000-0700" },
        "duration": 139,
        "thumbnailUrl": "https://example.com/fightclub.jpg",
        "shortDescription": "Um thriller psicológico sobre um trabalhador de escritório insone e um vendedor de sabão que formam um clube de luta subterrâneo.",
        "longDescription": "Clube da Luta é um filme americano de 1999 dirigido por David Fincher e estrelado por Brad Pitt, Edward Norton e Helena Bonham Carter. É baseado no romance de 1996 de mesmo nome de Chuck Palahniuk. Norton interpreta o protagonista sem nome, referido como o narrador, que está descontente com seu emprego de colarinho branco. Ele forma um 'clube da luta' com o vendedor de sabão Tyler Durden, interpretado por Pitt, e se envolve em um relacionamento com ele e com uma mulher dissoluta, Marla Singer, interpretada por Bonham Carter.",
        "status": "RELEASED",
        "directors": ["David Fincher"],
        "cast": ["Brad Pitt", "Edward Norton", "Helena Bonham Carter", "Meat Loaf"],
        "categories": ["Drama", "Terror"]
    },
    {
        "title": "Bastardos Inglórios",
        "releaseDate": { "$date": "2009-08-21T00:00:00.000-0700" },
        "duration": 153,
        "thumbnailUrl": "https://example.com/inglouriousbasterds.jpg",
        "shortDescription": "Um filme de guerra sobre um grupo de soldados judeu-americanos que planejam assassinar líderes nazistas.",
        "longDescription": "Bastardos Inglórios é um filme de guerra de 2009 escrito e dirigido por Quentin Tarantino e estrelado por Brad Pitt, Christoph Waltz, Michael Fassbender, Eli Roth, Diane Kruger, Til Schweiger, Mélanie Laurent e Mike Myers. O filme conta uma história de história alternativa de dois complôs para assassinar a liderança da Alemanha nazista, um planejado por Shosanna Dreyfus (Laurent), uma jovem proprietária francesa de cinema judia, e outro por uma equipe de soldados judeu-americanos liderados pelo Primeiro Tenente Aldo Raine (Pitt).",
        "status": "RELEASED",
        "directors": ["Quentin Tarantino"],
        "cast": ["Brad Pitt", "Christoph Waltz", "Mélanie Laurent", "Michael Fassbender"],
        "categories": ["Guerra", "Drama"]
    },
	{
        "title": "Um Lugar Chamado Notting Hill",
        "releaseDate": { "$date": "1999-05-28T00:00:00.000-0700" },
        "duration": 124,
        "thumbnailUrl": "https://example.com/nottinghill.jpg",
        "shortDescription": "Uma comédia romântica sobre um dono de livraria que se apaixona por uma famosa atriz americana.",
        "longDescription": "Um Lugar Chamado Notting Hill é um filme de comédia romântica de 1999 dirigido por Roger Michell e estrelado por Hugh Grant e Julia Roberts. O roteiro foi escrito por Richard Curtis, que já havia trabalhado com Grant em Quatro Casamentos e um Funeral. O filme segue a vida de um simples dono de livraria em Notting Hill que conhece uma famosa atriz americana e eventualmente se apaixona por ela.",
        "status": "LANÇADO",
        "directors": ["Roger Michell"],
        "cast": ["Hugh Grant", "Julia Roberts", "Rhys Ifans", "Emma Chambers"],
        "categories": ["Romance", "Comédia"]
    },
    {
        "title": "Simplesmente Amor",
        "releaseDate": { "$date": "2003-11-14T00:00:00.000-0700" },
        "duration": 135,
        "thumbnailUrl": "https://example.com/loveactually.jpg",
        "shortDescription": "Uma comédia romântica que acompanha a vida de oito casais muito diferentes lidando com suas vidas amorosas.",
        "longDescription": "Simplesmente Amor é um filme de comédia romântica de 2003 escrito e dirigido por Richard Curtis. O elenco conta com Hugh Grant, Liam Neeson, Colin Firth, Laura Linney, Emma Thompson, Alan Rickman, Keira Knightley, Martine McCutcheon, Bill Nighy e Rowan Atkinson. O filme explora diferentes aspectos do amor por meio de dez histórias separadas envolvendo uma ampla variedade de indivíduos, muitos dos quais se mostram interligados à medida que suas histórias avançam.",
        "status": "LANÇADO",
        "directors": ["Richard Curtis"],
        "cast": ["Hugh Grant", "Liam Neeson", "Colin Firth", "Emma Thompson"],
        "categories": ["Romance", "Comédia"]
    },
    {
        "title": "Harry e Sally: Feitos Um para o Outro",
        "releaseDate": { "$date": "1989-07-21T00:00:00.000-0700" },
        "duration": 96,
        "thumbnailUrl": "https://example.com/whenharrymetsally.jpg",
        "shortDescription": "Uma comédia romântica sobre a difícil, porém emocionante, relação entre Harry e Sally ao longo dos anos.",
        "longDescription": "Harry e Sally: Feitos Um para o Outro é um filme de comédia romântica americano de 1989 escrito por Nora Ephron e dirigido por Rob Reiner. Billy Crystal interpreta Harry e Meg Ryan interpreta Sally, que compartilham uma relação complicada ao longo de vários anos. O filme levanta a questão se homens e mulheres podem apenas ser amigos e explora vários temas de amor, amizade e timing.",
        "status": "LANÇADO",
        "directors": ["Rob Reiner"],
        "cast": ["Billy Crystal", "Meg Ryan", "Carrie Fisher", "Bruno Kirby"],
        "categories": ["Romance", "Comédia"]
    },
    {
        "title": "A Proposta",
        "releaseDate": { "$date": "2009-06-19T00:00:00.000-0700" },
        "duration": 108,
        "thumbnailUrl": "https://example.com/theproposal.jpg",
        "shortDescription": "Uma comédia romântica sobre uma executiva canadense que descobre que pode ser deportada dos EUA e persuade seu assistente a se casar com ela.",
        "longDescription": "A Proposta é um filme de comédia romântica de 2009 dirigido por Anne Fletcher e estrelado por Sandra Bullock e Ryan Reynolds. A trama gira em torno de uma executiva canadense que descobre que pode ser deportada dos EUA e convence seu assistente a temporariamente atuar como seu noivo. Os dois então partem para o Alasca para conhecer sua excêntrica família e tentar convencer os oficiais de imigração de que seu casamento é genuíno.",
        "status": "LANÇADO",
        "directors": ["Anne Fletcher"],
        "cast": ["Sandra Bullock", "Ryan Reynolds", "Mary Steenburgen", "Betty White"],
        "categories": ["Romance", "Comédia"]
    },
    {
        "title": "O Grande Hotel Budapeste",
        "releaseDate": { "$date": "2014-03-28T00:00:00.000-0700" },
        "duration": 99,
        "thumbnailUrl": "https://example.com/grandbudapesthotel.jpg",
        "shortDescription": "Um filme de comédia-drama sobre as aventuras de um lendário concierge em um famoso hotel europeu.",
        "longDescription": "O Grande Hotel Budapeste é um filme de comédia-drama de 2014 escrito e dirigido por Wes Anderson. Estrela Ralph Fiennes como Gustave H., um lendário concierge em um famoso hotel europeu entre as guerras, e Zero Moustafa, o garoto do lobby que se torna seu amigo mais confiável. A história envolve o roubo e a recuperação de uma pintura renascentista inestimável e a batalha por uma enorme fortuna familiar—tudo contra o pano de fundo de um continente que muda de forma repentina e dramática.",
        "status": "LANÇADO",
        "directors": ["Wes Anderson"],
        "cast": ["Ralph Fiennes", "F. Murray Abraham", "Mathieu Amalric", "Adrien Brody"],
        "categories": ["Comédia", "Drama"]
    }
]

